## Apply result

Show apply for the following directories:

<details><summary>live/dev</summary>


<pre>
The stack at live/dev will be processed in the following order for command apply:
Group 1
- Module ./bar/network/vpc


[bar/network/vpc] : Terraform used the selected providers to generate the following execution
[bar/network/vpc] : plan. Resource actions are indicated with the following symbols:
[bar/network/vpc] :   + create
[bar/network/vpc] : Terraform will perform the following actions:
[bar/network/vpc] :   # aws_cloudwatch_log_group.this[0] will be created
[bar/network/vpc] :   + resource "aws_cloudwatch_log_group" "this" {
[bar/network/vpc] :       + arn               = (known after apply)
[bar/network/vpc] :       + id                = (known after apply)
[bar/network/vpc] :       + log_group_class   = (known after apply)
[bar/network/vpc] :       + name              = (known after apply)
[bar/network/vpc] :       + name_prefix       = (known after apply)
[bar/network/vpc] :       + retention_in_days = 7
[bar/network/vpc] :       + skip_destroy      = false
[bar/network/vpc] :       + tags              = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "cloudwatch-log-group-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + tags_all          = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "cloudwatch-log-group-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_eip.this will be created
[bar/network/vpc] :   + resource "aws_eip" "this" {
[bar/network/vpc] :       + allocation_id             = (known after apply)
[bar/network/vpc] :       + arn                       = (known after apply)
[bar/network/vpc] :       + associate_with_private_ip = "192.169.1.10"
[bar/network/vpc] :       + association_id            = (known after apply)
[bar/network/vpc] :       + carrier_ip                = (known after apply)
[bar/network/vpc] :       + customer_owned_ip         = (known after apply)
[bar/network/vpc] :       + domain                    = (known after apply)
[bar/network/vpc] :       + id                        = (known after apply)
[bar/network/vpc] :       + instance                  = (known after apply)
[bar/network/vpc] :       + ipam_pool_id              = (known after apply)
[bar/network/vpc] :       + network_border_group      = (known after apply)
[bar/network/vpc] :       + network_interface         = (known after apply)
[bar/network/vpc] :       + private_dns               = (known after apply)
[bar/network/vpc] :       + private_ip                = (known after apply)
[bar/network/vpc] :       + ptr_record                = (known after apply)
[bar/network/vpc] :       + public_dns                = (known after apply)
[bar/network/vpc] :       + public_ip                 = (known after apply)
[bar/network/vpc] :       + public_ipv4_pool          = (known after apply)
[bar/network/vpc] :       + tags                      = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "eip-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + tags_all                  = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "eip-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + vpc                       = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_flow_log.this[0] will be created
[bar/network/vpc] :   + resource "aws_flow_log" "this" {
[bar/network/vpc] :       + arn                      = (known after apply)
[bar/network/vpc] :       + iam_role_arn             = (known after apply)
[bar/network/vpc] :       + id                       = (known after apply)
[bar/network/vpc] :       + log_destination          = (known after apply)
[bar/network/vpc] :       + log_destination_type     = "cloud-watch-logs"
[bar/network/vpc] :       + log_format               = (known after apply)
[bar/network/vpc] :       + log_group_name           = (known after apply)
[bar/network/vpc] :       + max_aggregation_interval = 600
[bar/network/vpc] :       + tags                     = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "flow-log-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + tags_all                 = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "flow-log-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + traffic_type             = "ALL"
[bar/network/vpc] :       + vpc_id                   = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_iam_role.this[0] will be created
[bar/network/vpc] :   + resource "aws_iam_role" "this" {
[bar/network/vpc] :       + arn                   = (known after apply)
[bar/network/vpc] :       + assume_role_policy    = jsonencode(
[bar/network/vpc] :             {
[bar/network/vpc] :               + Statement = [
[bar/network/vpc] :                   + {
[bar/network/vpc] :                       + Action    = "sts:AssumeRole"
[bar/network/vpc] :                       + Effect    = "Allow"
[bar/network/vpc] :                       + Principal = {
[bar/network/vpc] :                           + Service = "vpc-flow-logs.amazonaws.com"
[bar/network/vpc] :                         }
[bar/network/vpc] :                     },
[bar/network/vpc] :                 ]
[bar/network/vpc] :               + Version   = "2012-10-17"
[bar/network/vpc] :             }
[bar/network/vpc] :         )
[bar/network/vpc] :       + create_date           = (known after apply)
[bar/network/vpc] :       + force_detach_policies = false
[bar/network/vpc] :       + id                    = (known after apply)
[bar/network/vpc] :       + managed_policy_arns   = (known after apply)
[bar/network/vpc] :       + max_session_duration  = 3600
[bar/network/vpc] :       + name                  = "flow-log-role-bar-app-dev"
[bar/network/vpc] :       + name_prefix           = (known after apply)
[bar/network/vpc] :       + path                  = "/"
[bar/network/vpc] :       + tags_all              = (known after apply)
[bar/network/vpc] :       + unique_id             = (known after apply)
[bar/network/vpc] :       + inline_policy (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_iam_role_policy.this[0] will be created
[bar/network/vpc] :   + resource "aws_iam_role_policy" "this" {
[bar/network/vpc] :       + id          = (known after apply)
[bar/network/vpc] :       + name        = "flow-log-policy-bar-app-dev"
[bar/network/vpc] :       + name_prefix = (known after apply)
[bar/network/vpc] :       + policy      = jsonencode(
[bar/network/vpc] :             {
[bar/network/vpc] :               + Statement = [
[bar/network/vpc] :                   + {
[bar/network/vpc] :                       + Action   = [
[bar/network/vpc] :                           + "logs:CreateLogGroup",
[bar/network/vpc] :                           + "logs:CreateLogStream",
[bar/network/vpc] :                           + "logs:PutLogEvents",
[bar/network/vpc] :                           + "logs:DescribeLogGroups",
[bar/network/vpc] :                           + "logs:DescribeLogStreams",
[bar/network/vpc] :                         ]
[bar/network/vpc] :                       + Effect   = "Allow"
[bar/network/vpc] :                       + Resource = "*"
[bar/network/vpc] :                     },
[bar/network/vpc] :                 ]
[bar/network/vpc] :               + Version   = "2012-10-17"
[bar/network/vpc] :             }
[bar/network/vpc] :         )
[bar/network/vpc] :       + role        = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_internet_gateway.this will be created
[bar/network/vpc] :   + resource "aws_internet_gateway" "this" {
[bar/network/vpc] :       + arn      = (known after apply)
[bar/network/vpc] :       + id       = (known after apply)
[bar/network/vpc] :       + owner_id = (known after apply)
[bar/network/vpc] :       + tags     = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "igw-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + tags_all = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "igw-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + vpc_id   = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_nat_gateway.this will be created
[bar/network/vpc] :   + resource "aws_nat_gateway" "this" {
[bar/network/vpc] :       + allocation_id                      = (known after apply)
[bar/network/vpc] :       + association_id                     = (known after apply)
[bar/network/vpc] :       + connectivity_type                  = "public"
[bar/network/vpc] :       + id                                 = (known after apply)
[bar/network/vpc] :       + network_interface_id               = (known after apply)
[bar/network/vpc] :       + private_ip                         = (known after apply)
[bar/network/vpc] :       + public_ip                          = (known after apply)
[bar/network/vpc] :       + secondary_private_ip_address_count = (known after apply)
[bar/network/vpc] :       + secondary_private_ip_addresses     = (known after apply)
[bar/network/vpc] :       + subnet_id                          = (known after apply)
[bar/network/vpc] :       + tags                               = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "nat-gateway-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + tags_all                           = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "nat-gateway-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_route_table.private will be created
[bar/network/vpc] :   + resource "aws_route_table" "private" {
[bar/network/vpc] :       + arn              = (known after apply)
[bar/network/vpc] :       + id               = (known after apply)
[bar/network/vpc] :       + owner_id         = (known after apply)
[bar/network/vpc] :       + propagating_vgws = (known after apply)
[bar/network/vpc] :       + route            = [
[bar/network/vpc] :           + {
[bar/network/vpc] :               + cidr_block                 = "0.0.0.0/0"
[bar/network/vpc] :               + nat_gateway_id             = (known after apply)
[bar/network/vpc] :                 # (11 unchanged attributes hidden)
[bar/network/vpc] :             },
[bar/network/vpc] :         ]
[bar/network/vpc] :       + tags             = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "private-route-table-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + tags_all         = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "private-route-table-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + vpc_id           = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_route_table.public will be created
[bar/network/vpc] :   + resource "aws_route_table" "public" {
[bar/network/vpc] :       + arn              = (known after apply)
[bar/network/vpc] :       + id               = (known after apply)
[bar/network/vpc] :       + owner_id         = (known after apply)
[bar/network/vpc] :       + propagating_vgws = (known after apply)
[bar/network/vpc] :       + route            = [
[bar/network/vpc] :           + {
[bar/network/vpc] :               + cidr_block                 = "0.0.0.0/0"
[bar/network/vpc] :               + gateway_id                 = (known after apply)
[bar/network/vpc] :                 # (11 unchanged attributes hidden)
[bar/network/vpc] :             },
[bar/network/vpc] :         ]
[bar/network/vpc] :       + tags             = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "public-route-table-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + tags_all         = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "public-route-table-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + vpc_id           = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_route_table_association.private["private-subnet-1"] will be created
[bar/network/vpc] :   + resource "aws_route_table_association" "private" {
[bar/network/vpc] :       + id             = (known after apply)
[bar/network/vpc] :       + route_table_id = (known after apply)
[bar/network/vpc] :       + subnet_id      = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_route_table_association.private["private-subnet-2"] will be created
[bar/network/vpc] :   + resource "aws_route_table_association" "private" {
[bar/network/vpc] :       + id             = (known after apply)
[bar/network/vpc] :       + route_table_id = (known after apply)
[bar/network/vpc] :       + subnet_id      = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_route_table_association.public["public-subnet-1"] will be created
[bar/network/vpc] :   + resource "aws_route_table_association" "public" {
[bar/network/vpc] :       + id             = (known after apply)
[bar/network/vpc] :       + route_table_id = (known after apply)
[bar/network/vpc] :       + subnet_id      = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_subnet.private["private-subnet-1"] will be created
[bar/network/vpc] :   + resource "aws_subnet" "private" {
[bar/network/vpc] :       + arn                                            = (known after apply)
[bar/network/vpc] :       + assign_ipv6_address_on_creation                = false
[bar/network/vpc] :       + availability_zone                              = "us-west-1a"
[bar/network/vpc] :       + availability_zone_id                           = (known after apply)
[bar/network/vpc] :       + cidr_block                                     = "192.169.2.0/24"
[bar/network/vpc] :       + enable_dns64                                   = false
[bar/network/vpc] :       + enable_resource_name_dns_a_record_on_launch    = false
[bar/network/vpc] :       + enable_resource_name_dns_aaaa_record_on_launch = false
[bar/network/vpc] :       + id                                             = (known after apply)
[bar/network/vpc] :       + ipv6_cidr_block_association_id                 = (known after apply)
[bar/network/vpc] :       + ipv6_native                                    = false
[bar/network/vpc] :       + map_public_ip_on_launch                        = false
[bar/network/vpc] :       + owner_id                                       = (known after apply)
[bar/network/vpc] :       + private_dns_hostname_type_on_launch            = (known after apply)
[bar/network/vpc] :       + tags                                           = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "private-subnet-bar-app-dev-1a"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + tags_all                                       = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "private-subnet-bar-app-dev-1a"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + vpc_id                                         = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_subnet.private["private-subnet-2"] will be created
[bar/network/vpc] :   + resource "aws_subnet" "private" {
[bar/network/vpc] :       + arn                                            = (known after apply)
[bar/network/vpc] :       + assign_ipv6_address_on_creation                = false
[bar/network/vpc] :       + availability_zone                              = "us-west-1b"
[bar/network/vpc] :       + availability_zone_id                           = (known after apply)
[bar/network/vpc] :       + cidr_block                                     = "192.169.3.0/24"
[bar/network/vpc] :       + enable_dns64                                   = false
[bar/network/vpc] :       + enable_resource_name_dns_a_record_on_launch    = false
[bar/network/vpc] :       + enable_resource_name_dns_aaaa_record_on_launch = false
[bar/network/vpc] :       + id                                             = (known after apply)
[bar/network/vpc] :       + ipv6_cidr_block_association_id                 = (known after apply)
[bar/network/vpc] :       + ipv6_native                                    = false
[bar/network/vpc] :       + map_public_ip_on_launch                        = false
[bar/network/vpc] :       + owner_id                                       = (known after apply)
[bar/network/vpc] :       + private_dns_hostname_type_on_launch            = (known after apply)
[bar/network/vpc] :       + tags                                           = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "private-subnet-bar-app-dev-1c"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + tags_all                                       = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "private-subnet-bar-app-dev-1c"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + vpc_id                                         = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_subnet.public["public-subnet-1"] will be created
[bar/network/vpc] :   + resource "aws_subnet" "public" {
[bar/network/vpc] :       + arn                                            = (known after apply)
[bar/network/vpc] :       + assign_ipv6_address_on_creation                = false
[bar/network/vpc] :       + availability_zone                              = "us-west-1a"
[bar/network/vpc] :       + availability_zone_id                           = (known after apply)
[bar/network/vpc] :       + cidr_block                                     = "192.169.1.0/24"
[bar/network/vpc] :       + enable_dns64                                   = false
[bar/network/vpc] :       + enable_resource_name_dns_a_record_on_launch    = false
[bar/network/vpc] :       + enable_resource_name_dns_aaaa_record_on_launch = false
[bar/network/vpc] :       + id                                             = (known after apply)
[bar/network/vpc] :       + ipv6_cidr_block_association_id                 = (known after apply)
[bar/network/vpc] :       + ipv6_native                                    = false
[bar/network/vpc] :       + map_public_ip_on_launch                        = true
[bar/network/vpc] :       + owner_id                                       = (known after apply)
[bar/network/vpc] :       + private_dns_hostname_type_on_launch            = (known after apply)
[bar/network/vpc] :       + tags                                           = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "public-subnet-bar-app-dev-1a"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + tags_all                                       = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "public-subnet-bar-app-dev-1a"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + vpc_id                                         = (known after apply)
[bar/network/vpc] :     }
[bar/network/vpc] :   # aws_vpc.this will be created
[bar/network/vpc] :   + resource "aws_vpc" "this" {
[bar/network/vpc] :       + arn                                  = (known after apply)
[bar/network/vpc] :       + cidr_block                           = "192.169.0.0/16"
[bar/network/vpc] :       + default_network_acl_id               = (known after apply)
[bar/network/vpc] :       + default_route_table_id               = (known after apply)
[bar/network/vpc] :       + default_security_group_id            = (known after apply)
[bar/network/vpc] :       + dhcp_options_id                      = (known after apply)
[bar/network/vpc] :       + enable_dns_hostnames                 = true
[bar/network/vpc] :       + enable_dns_support                   = true
[bar/network/vpc] :       + enable_network_address_usage_metrics = (known after apply)
[bar/network/vpc] :       + id                                   = (known after apply)
[bar/network/vpc] :       + instance_tenancy                     = "default"
[bar/network/vpc] :       + ipv6_association_id                  = (known after apply)
[bar/network/vpc] :       + ipv6_cidr_block                      = (known after apply)
[bar/network/vpc] :       + ipv6_cidr_block_network_border_group = (known after apply)
[bar/network/vpc] :       + main_route_table_id                  = (known after apply)
[bar/network/vpc] :       + owner_id                             = (known after apply)
[bar/network/vpc] :       + tags                                 = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "vpc-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :       + tags_all                             = {
[bar/network/vpc] :           + "application_name" = "bar"
[bar/network/vpc] :           + "environment"      = "development"
[bar/network/vpc] :           + "managed_by"       = "terraform"
[bar/network/vpc] :           + "name"             = "vpc-bar-app-dev"
[bar/network/vpc] :           + "team_owner"       = "bar-team"
[bar/network/vpc] :         }
[bar/network/vpc] :     }
[bar/network/vpc] : Plan: 16 to add, 0 to change, 0 to destroy.
[bar/network/vpc] : Changes to Outputs:
[bar/network/vpc] :   + cloudwatch_log_group_name = (known after apply)
[bar/network/vpc] :   + flow_log_id               = (known after apply)
[bar/network/vpc] :   + internet_gateway_id       = (known after apply)
[bar/network/vpc] :   + nat_gateway_id            = (known after apply)
[bar/network/vpc] :   + private_subnets           = {
[bar/network/vpc] :       + private-subnet-1 = {
[bar/network/vpc] :           + arn                                            = (known after apply)
[bar/network/vpc] :           + assign_ipv6_address_on_creation                = false
[bar/network/vpc] :           + availability_zone                              = "us-west-1a"
[bar/network/vpc] :           + availability_zone_id                           = (known after apply)
[bar/network/vpc] :           + cidr_block                                     = "192.169.2.0/24"
[bar/network/vpc] :           + customer_owned_ipv4_pool                       = null
[bar/network/vpc] :           + enable_dns64                                   = false
[bar/network/vpc] :           + enable_lni_at_device_index                     = null
[bar/network/vpc] :           + enable_resource_name_dns_a_record_on_launch    = false
[bar/network/vpc] :           + enable_resource_name_dns_aaaa_record_on_launch = false
[bar/network/vpc] :           + id                                             = (known after apply)
[bar/network/vpc] :           + ipv6_cidr_block                                = null
[bar/network/vpc] :           + ipv6_cidr_block_association_id                 = (known after apply)
[bar/network/vpc] :           + ipv6_native                                    = false
[bar/network/vpc] :           + map_customer_owned_ip_on_launch                = null
[bar/network/vpc] :           + map_public_ip_on_launch                        = false
[bar/network/vpc] :           + outpost_arn                                    = null
[bar/network/vpc] :           + owner_id                                       = (known after apply)
[bar/network/vpc] :           + private_dns_hostname_type_on_launch            = (known after apply)
[bar/network/vpc] :           + tags                                           = {
[bar/network/vpc] :               + application_name = "bar"
[bar/network/vpc] :               + environment      = "development"
[bar/network/vpc] :               + managed_by       = "terraform"
[bar/network/vpc] :               + name             = "private-subnet-bar-app-dev-1a"
[bar/network/vpc] :               + team_owner       = "bar-team"
[bar/network/vpc] :             }
[bar/network/vpc] :           + tags_all                                       = {
[bar/network/vpc] :               + application_name = "bar"
[bar/network/vpc] :               + environment      = "development"
[bar/network/vpc] :               + managed_by       = "terraform"
[bar/network/vpc] :               + name             = "private-subnet-bar-app-dev-1a"
[bar/network/vpc] :               + team_owner       = "bar-team"
[bar/network/vpc] :             }
[bar/network/vpc] :           + timeouts                                       = null
[bar/network/vpc] :           + vpc_id                                         = (known after apply)
[bar/network/vpc] :         }
[bar/network/vpc] :       + private-subnet-2 = {
[bar/network/vpc] :           + arn                                            = (known after apply)
[bar/network/vpc] :           + assign_ipv6_address_on_creation                = false
[bar/network/vpc] :           + availability_zone                              = "us-west-1b"
[bar/network/vpc] :           + availability_zone_id                           = (known after apply)
[bar/network/vpc] :           + cidr_block                                     = "192.169.3.0/24"
[bar/network/vpc] :           + customer_owned_ipv4_pool                       = null
[bar/network/vpc] :           + enable_dns64                                   = false
[bar/network/vpc] :           + enable_lni_at_device_index                     = null
[bar/network/vpc] :           + enable_resource_name_dns_a_record_on_launch    = false
[bar/network/vpc] :           + enable_resource_name_dns_aaaa_record_on_launch = false
[bar/network/vpc] :           + id                                             = (known after apply)
[bar/network/vpc] :           + ipv6_cidr_block                                = null
[bar/network/vpc] :           + ipv6_cidr_block_association_id                 = (known after apply)
[bar/network/vpc] :           + ipv6_native                                    = false
[bar/network/vpc] :           + map_customer_owned_ip_on_launch                = null
[bar/network/vpc] :           + map_public_ip_on_launch                        = false
[bar/network/vpc] :           + outpost_arn                                    = null
[bar/network/vpc] :           + owner_id                                       = (known after apply)
[bar/network/vpc] :           + private_dns_hostname_type_on_launch            = (known after apply)
[bar/network/vpc] :           + tags                                           = {
[bar/network/vpc] :               + application_name = "bar"
[bar/network/vpc] :               + environment      = "development"
[bar/network/vpc] :               + managed_by       = "terraform"
[bar/network/vpc] :               + name             = "private-subnet-bar-app-dev-1c"
[bar/network/vpc] :               + team_owner       = "bar-team"
[bar/network/vpc] :             }
[bar/network/vpc] :           + tags_all                                       = {
[bar/network/vpc] :               + application_name = "bar"
[bar/network/vpc] :               + environment      = "development"
[bar/network/vpc] :               + managed_by       = "terraform"
[bar/network/vpc] :               + name             = "private-subnet-bar-app-dev-1c"
[bar/network/vpc] :               + team_owner       = "bar-team"
[bar/network/vpc] :             }
[bar/network/vpc] :           + timeouts                                       = null
[bar/network/vpc] :           + vpc_id                                         = (known after apply)
[bar/network/vpc] :         }
[bar/network/vpc] :     }
[bar/network/vpc] :   + public_subnets            = {
[bar/network/vpc] :       + public-subnet-1 = {
[bar/network/vpc] :           + arn                                            = (known after apply)
[bar/network/vpc] :           + assign_ipv6_address_on_creation                = false
[bar/network/vpc] :           + availability_zone                              = "us-west-1a"
[bar/network/vpc] :           + availability_zone_id                           = (known after apply)
[bar/network/vpc] :           + cidr_block                                     = "192.169.1.0/24"
[bar/network/vpc] :           + customer_owned_ipv4_pool                       = null
[bar/network/vpc] :           + enable_dns64                                   = false
[bar/network/vpc] :           + enable_lni_at_device_index                     = null
[bar/network/vpc] :           + enable_resource_name_dns_a_record_on_launch    = false
[bar/network/vpc] :           + enable_resource_name_dns_aaaa_record_on_launch = false
[bar/network/vpc] :           + id                                             = (known after apply)
[bar/network/vpc] :           + ipv6_cidr_block                                = null
[bar/network/vpc] :           + ipv6_cidr_block_association_id                 = (known after apply)
[bar/network/vpc] :           + ipv6_native                                    = false
[bar/network/vpc] :           + map_customer_owned_ip_on_launch                = null
[bar/network/vpc] :           + map_public_ip_on_launch                        = true
[bar/network/vpc] :           + outpost_arn                                    = null
[bar/network/vpc] :           + owner_id                                       = (known after apply)
[bar/network/vpc] :           + private_dns_hostname_type_on_launch            = (known after apply)
[bar/network/vpc] :           + tags                                           = {
[bar/network/vpc] :               + application_name = "bar"
[bar/network/vpc] :               + environment      = "development"
[bar/network/vpc] :               + managed_by       = "terraform"
[bar/network/vpc] :               + name             = "public-subnet-bar-app-dev-1a"
[bar/network/vpc] :               + team_owner       = "bar-team"
[bar/network/vpc] :             }
[bar/network/vpc] :           + tags_all                                       = {
[bar/network/vpc] :               + application_name = "bar"
[bar/network/vpc] :               + environment      = "development"
[bar/network/vpc] :               + managed_by       = "terraform"
[bar/network/vpc] :               + name             = "public-subnet-bar-app-dev-1a"
[bar/network/vpc] :               + team_owner       = "bar-team"
[bar/network/vpc] :             }
[bar/network/vpc] :           + timeouts                                       = null
[bar/network/vpc] :           + vpc_id                                         = (known after apply)
[bar/network/vpc] :         }
[bar/network/vpc] :     }
[bar/network/vpc] :   + vpc_id                    = (known after apply)
[bar/network/vpc] : aws_iam_role.this[0]: Creating...
[bar/network/vpc] : aws_eip.this: Creating...
[bar/network/vpc] : aws_vpc.this: Creating...
[bar/network/vpc] : aws_iam_role.this[0]: Creation complete after 0s [id=flow-log-role-bar-app-dev]
[bar/network/vpc] : aws_iam_role_policy.this[0]: Creating...
[bar/network/vpc] : aws_iam_role_policy.this[0]: Creation complete after 0s [id=flow-log-role-bar-app-dev:flow-log-policy-bar-app-dev]
[bar/network/vpc] : aws_eip.this: Creation complete after 1s [id=eipalloc-a3bec0812eca732fa]
[bar/network/vpc] : aws_vpc.this: Still creating... [10s elapsed]
[bar/network/vpc] : aws_vpc.this: Creation complete after 11s [id=vpc-aff2a4e8e71f35143]
[bar/network/vpc] : aws_subnet.public["public-subnet-1"]: Creating...
[bar/network/vpc] : aws_cloudwatch_log_group.this[0]: Creating...
[bar/network/vpc] : aws_subnet.private["private-subnet-1"]: Creating...
[bar/network/vpc] : aws_internet_gateway.this: Creating...
[bar/network/vpc] : aws_subnet.private["private-subnet-2"]: Creating...
[bar/network/vpc] : aws_internet_gateway.this: Creation complete after 0s [id=igw-30c4e8700b3efe5ce]
[bar/network/vpc] : aws_subnet.private["private-subnet-1"]: Creation complete after 0s [id=subnet-236218af21483cf50]
[bar/network/vpc] : aws_subnet.private["private-subnet-2"]: Creation complete after 0s [id=subnet-dcced66baae3ac979]
[bar/network/vpc] : aws_route_table.public: Creating...
[bar/network/vpc] : aws_cloudwatch_log_group.this[0]: Creation complete after 1s [id=/aws/vpc/flow-logs/vpc-aff2a4e8e71f35143]
[bar/network/vpc] : aws_flow_log.this[0]: Creating...
[bar/network/vpc] : aws_flow_log.this[0]: Creation complete after 0s [id=fl-1fc2952c5fd80fc33]
[bar/network/vpc] : aws_route_table.public: Creation complete after 1s [id=rtb-6b1864b18caa5366d]
[bar/network/vpc] : aws_subnet.public["public-subnet-1"]: Still creating... [10s elapsed]
[bar/network/vpc] : aws_subnet.public["public-subnet-1"]: Creation complete after 10s [id=subnet-d746f279f08ea0035]
[bar/network/vpc] : aws_route_table_association.public["public-subnet-1"]: Creating...
[bar/network/vpc] : aws_nat_gateway.this: Creating...
[bar/network/vpc] : aws_route_table_association.public["public-subnet-1"]: Creation complete after 0s [id=rtbassoc-226b13062f89c67ee]
[bar/network/vpc] : aws_nat_gateway.this: Creation complete after 0s [id=nat-151b0217e88a46425]
[bar/network/vpc] : aws_route_table.private: Creating...
[bar/network/vpc] : aws_route_table.private: Creation complete after 1s [id=rtb-277e0ae5345fe74aa]
[bar/network/vpc] : aws_route_table_association.private["private-subnet-2"]: Creating...
[bar/network/vpc] : aws_route_table_association.private["private-subnet-1"]: Creating...
[bar/network/vpc] : aws_route_table_association.private["private-subnet-1"]: Creation complete after 0s [id=rtbassoc-5d0918065e8cb8e4f]
[bar/network/vpc] : aws_route_table_association.private["private-subnet-2"]: Creation complete after 0s [id=rtbassoc-11729fc1341fdc21f]
[bar/network/vpc] : Apply complete! Resources: 16 added, 0 changed, 0 destroyed.
[bar/network/vpc] : Outputs:
[bar/network/vpc] : cloudwatch_log_group_name = "/aws/vpc/flow-logs/vpc-aff2a4e8e71f35143"
[bar/network/vpc] : flow_log_id = "fl-1fc2952c5fd80fc33"
[bar/network/vpc] : internet_gateway_id = "igw-30c4e8700b3efe5ce"
[bar/network/vpc] : nat_gateway_id = "nat-151b0217e88a46425"
[bar/network/vpc] : private_subnets = {
[bar/network/vpc] :   "private-subnet-1" = {
[bar/network/vpc] :     "arn" = "arn:aws:ec2:us-west-1:000000000000:subnet/subnet-236218af21483cf50"
[bar/network/vpc] :     "assign_ipv6_address_on_creation" = false
[bar/network/vpc] :     "availability_zone" = "us-west-1a"
[bar/network/vpc] :     "availability_zone_id" = "usw1-az3"
[bar/network/vpc] :     "cidr_block" = "192.169.2.0/24"
[bar/network/vpc] :     "customer_owned_ipv4_pool" = ""
[bar/network/vpc] :     "enable_dns64" = false
[bar/network/vpc] :     "enable_lni_at_device_index" = 0
[bar/network/vpc] :     "enable_resource_name_dns_a_record_on_launch" = false
[bar/network/vpc] :     "enable_resource_name_dns_aaaa_record_on_launch" = false
[bar/network/vpc] :     "id" = "subnet-236218af21483cf50"
[bar/network/vpc] :     "ipv6_cidr_block" = ""
[bar/network/vpc] :     "ipv6_cidr_block_association_id" = ""
[bar/network/vpc] :     "ipv6_native" = false
[bar/network/vpc] :     "map_customer_owned_ip_on_launch" = false
[bar/network/vpc] :     "map_public_ip_on_launch" = false
[bar/network/vpc] :     "outpost_arn" = ""
[bar/network/vpc] :     "owner_id" = "000000000000"
[bar/network/vpc] :     "private_dns_hostname_type_on_launch" = "ip-name"
[bar/network/vpc] :     "tags" = tomap({
[bar/network/vpc] :       "application_name" = "bar"
[bar/network/vpc] :       "environment" = "development"
[bar/network/vpc] :       "managed_by" = "terraform"
[bar/network/vpc] :       "name" = "private-subnet-bar-app-dev-1a"
[bar/network/vpc] :       "team_owner" = "bar-team"
[bar/network/vpc] :     })
[bar/network/vpc] :     "tags_all" = tomap({
[bar/network/vpc] :       "application_name" = "bar"
[bar/network/vpc] :       "environment" = "development"
[bar/network/vpc] :       "managed_by" = "terraform"
[bar/network/vpc] :       "name" = "private-subnet-bar-app-dev-1a"
[bar/network/vpc] :       "team_owner" = "bar-team"
[bar/network/vpc] :     })
[bar/network/vpc] :     "timeouts" = null /* object */
[bar/network/vpc] :     "vpc_id" = "vpc-aff2a4e8e71f35143"
[bar/network/vpc] :   }
[bar/network/vpc] :   "private-subnet-2" = {
[bar/network/vpc] :     "arn" = "arn:aws:ec2:us-west-1:000000000000:subnet/subnet-dcced66baae3ac979"
[bar/network/vpc] :     "assign_ipv6_address_on_creation" = false
[bar/network/vpc] :     "availability_zone" = "us-west-1b"
[bar/network/vpc] :     "availability_zone_id" = "usw1-az1"
[bar/network/vpc] :     "cidr_block" = "192.169.3.0/24"
[bar/network/vpc] :     "customer_owned_ipv4_pool" = ""
[bar/network/vpc] :     "enable_dns64" = false
[bar/network/vpc] :     "enable_lni_at_device_index" = 0
[bar/network/vpc] :     "enable_resource_name_dns_a_record_on_launch" = false
[bar/network/vpc] :     "enable_resource_name_dns_aaaa_record_on_launch" = false
[bar/network/vpc] :     "id" = "subnet-dcced66baae3ac979"
[bar/network/vpc] :     "ipv6_cidr_block" = ""
[bar/network/vpc] :     "ipv6_cidr_block_association_id" = ""
[bar/network/vpc] :     "ipv6_native" = false
[bar/network/vpc] :     "map_customer_owned_ip_on_launch" = false
[bar/network/vpc] :     "map_public_ip_on_launch" = false
[bar/network/vpc] :     "outpost_arn" = ""
[bar/network/vpc] :     "owner_id" = "000000000000"
[bar/network/vpc] :     "private_dns_hostname_type_on_launch" = "ip-name"
[bar/network/vpc] :     "tags" = tomap({
[bar/network/vpc] :       "application_name" = "bar"
[bar/network/vpc] :       "environment" = "development"
[bar/network/vpc] :       "managed_by" = "terraform"
[bar/network/vpc] :       "name" = "private-subnet-bar-app-dev-1c"
[bar/network/vpc] :       "team_owner" = "bar-team"
[bar/network/vpc] :     })
[bar/network/vpc] :     "tags_all" = tomap({
[bar/network/vpc] :       "application_name" = "bar"
[bar/network/vpc] :       "environment" = "development"
[bar/network/vpc] :       "managed_by" = "terraform"
[bar/network/vpc] :       "name" = "private-subnet-bar-app-dev-1c"
[bar/network/vpc] :       "team_owner" = "bar-team"
[bar/network/vpc] :     })
[bar/network/vpc] :     "timeouts" = null /* object */
[bar/network/vpc] :     "vpc_id" = "vpc-aff2a4e8e71f35143"
[bar/network/vpc] :   }
[bar/network/vpc] : }
[bar/network/vpc] : public_subnets = {
[bar/network/vpc] :   "public-subnet-1" = {
[bar/network/vpc] :     "arn" = "arn:aws:ec2:us-west-1:000000000000:subnet/subnet-d746f279f08ea0035"
[bar/network/vpc] :     "assign_ipv6_address_on_creation" = false
[bar/network/vpc] :     "availability_zone" = "us-west-1a"
[bar/network/vpc] :     "availability_zone_id" = "usw1-az3"
[bar/network/vpc] :     "cidr_block" = "192.169.1.0/24"
[bar/network/vpc] :     "customer_owned_ipv4_pool" = ""
[bar/network/vpc] :     "enable_dns64" = false
[bar/network/vpc] :     "enable_lni_at_device_index" = 0
[bar/network/vpc] :     "enable_resource_name_dns_a_record_on_launch" = false
[bar/network/vpc] :     "enable_resource_name_dns_aaaa_record_on_launch" = false
[bar/network/vpc] :     "id" = "subnet-d746f279f08ea0035"
[bar/network/vpc] :     "ipv6_cidr_block" = ""
[bar/network/vpc] :     "ipv6_cidr_block_association_id" = ""
[bar/network/vpc] :     "ipv6_native" = false
[bar/network/vpc] :     "map_customer_owned_ip_on_launch" = false
[bar/network/vpc] :     "map_public_ip_on_launch" = true
[bar/network/vpc] :     "outpost_arn" = ""
[bar/network/vpc] :     "owner_id" = "000000000000"
[bar/network/vpc] :     "private_dns_hostname_type_on_launch" = "ip-name"
[bar/network/vpc] :     "tags" = tomap({
[bar/network/vpc] :       "application_name" = "bar"
[bar/network/vpc] :       "environment" = "development"
[bar/network/vpc] :       "managed_by" = "terraform"
[bar/network/vpc] :       "name" = "public-subnet-bar-app-dev-1a"
[bar/network/vpc] :       "team_owner" = "bar-team"
[bar/network/vpc] :     })
[bar/network/vpc] :     "tags_all" = tomap({
[bar/network/vpc] :       "application_name" = "bar"
[bar/network/vpc] :       "environment" = "development"
[bar/network/vpc] :       "managed_by" = "terraform"
[bar/network/vpc] :       "name" = "public-subnet-bar-app-dev-1a"
[bar/network/vpc] :       "team_owner" = "bar-team"
[bar/network/vpc] :     })
[bar/network/vpc] :     "timeouts" = null /* object */
[bar/network/vpc] :     "vpc_id" = "vpc-aff2a4e8e71f35143"
[bar/network/vpc] :   }
[bar/network/vpc] : }
[bar/network/vpc] : vpc_id = "vpc-aff2a4e8e71f35143"</pre>
</details>